Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX5112MTSH128S1.atdf
      <value-group caption="Write Protection Key" name="SFR_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x534652"/>
      </value-group>
    </module>
    <module caption="Special Function Register Backup" name="SFRBU" id="04479" version="A">
      <register-group name="SFRBU">
        <register caption="XTAL Oscillator Trimming Register" name="SFRBU_XTAL_TRIM" offset="0x10" rw="RW" size="4">
          <bitfield caption="32 kHz Crystal Oscillator Trimming Value" mask="0x00000003" name="XTAL_TRIM"/>
        </register>
        <register caption="Trimming Bits Register" name="SFRBU_TRIM" offset="0x14" rw="R" size="4">
          <bitfield caption="RC Oscillator Trimming Value" mask="0x0000003F" name="RC32"/>
          <bitfield caption="Conversion IP Bandgap Trimming Value" mask="0x00000F00" name="CONVBG"/>
          <bitfield caption="Power Management IP LDO Trimming Value" mask="0x000F0000" name="LDO"/>
          <bitfield caption="LDO Internal Bandgap Trimming for LCD Driver" mask="0x0F000000" name="LCD"/>
        </register>
        <register caption="Boot Register" name="SFRBU_BOOT" offset="0x20" rw="RW" size="4">
          <bitfield caption="Source for Booting Sequence" mask="0x00000001" name="SOURCE"/>
        </register>
        <register caption="IO Retention Register" name="SFRBU_IO_RETENTION" offset="0x30" rw="RW" size="4">
          <bitfield caption="Keep Function on PA0 to PA7" mask="0x00000001" name="PA_7_0"/>
          <bitfield caption="Keep Function on PA8 to PA15" mask="0x00000002" name="PA_15_8"/>
          <bitfield caption="Keep Function on PA16 to PA23" mask="0x00000004" name="PA_23_16"/>
          <bitfield caption="Keep Function on PA24 to PA31" mask="0x00000008" name="PA_31_24"/>
          <bitfield caption="Keep Function on PB0 to PB7" mask="0x00000010" name="PB_7_0"/>
          <bitfield caption="Keep Function on PB8 to PB15" mask="0x00000020" name="PB_15_8"/>
          <bitfield caption="Keep Function on PB216 to PB23" mask="0x00000040" name="PB_23_16"/>
          <bitfield caption="Keep Function on PB24 to PB26" mask="0x00000080" name="PB_26_24"/>
          <bitfield caption="Keep Function on PC0 to PC7" mask="0x00000100" name="PC_7_0"/>
          <bitfield caption="Keep Function on PC8 to PC15" mask="0x00000200" name="PC_15_8"/>
          <bitfield caption="Keep Function on PC16 to PC22" mask="0x00000400" name="PC_22_16"/>
          <bitfield caption="Keep Function on PD0 to PD7" mask="0x00001000" name="PD_7_0"/>
          <bitfield caption="Keep Function on PD8 to PD15" mask="0x00002000" name="PD_15_8"/>
          <bitfield caption="Keep Function on PD16 to PD23" mask="0x00004000" name="PD_23_16"/>
          <bitfield caption="Keep Function on PD24 to PD30" mask="0x00008000" name="PD_30_24"/>
          <bitfield caption="Keep Function on NRST" mask="0x00010000" name="NRST"/>
        </register>
        <register caption="BOD Core Register" name="SFRBU_BODCORE" offset="0x40" rw="RW" size="4">
          <bitfield caption="Core Brownout Detector" mask="0x00000001" name="STATUS"/>
        </register>
        <register caption="Power Switch Control Register" name="SFRBU_PWS_CNTRL" offset="0x50" rw="RW" size="4">
          <bitfield caption="Unmask Power Switch Control Signals" mask="0x00000001" name="UNMASK"/>
        </register>
        <register caption="Write Protection Mode Register" name="SFRBU_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SFRBU_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="SFRBU_WPSR" offset="0xE8" rw="RW" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Source" mask="0x00FFFF00" name="WPSRC"/>
        </register>
        <register caption="Spare Register" name="SFRBU_SPARE" offset="0xF0" rw="RW" size="4">
          <bitfield caption="Spare" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
      </register-group>
      <value-group caption="Write Protection Key" name="SFRBU_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x534652"/>
      </value-group>
    </module>
    <module caption="Segment LCD Controller" name="SLCDC" id="6259" version="K">
      <register-group name="SLCDC">
        <register caption="Control Register" name="SLCDC_CR" offset="0x0" rw="W" size="4">
          <bitfield caption="Enable the LCDC" mask="0x00000001" name="LCDEN"/>
          <bitfield caption="Disable LCDC" mask="0x00000002" name="LCDDIS"/>
          <bitfield caption="Software Reset" mask="0x00000008" name="SWRST"/>
          <bitfield caption="Freeze Display Panel Features Configuration" mask="0x00000040" name="FRZDF"/>
          <bitfield caption="Freeze Remap Configuration" mask="0x00000080" name="FRZMAP"/>
          <bitfield caption="Freeze Key (write-only)" mask="0x0000FF00" name="FRZKEY" values="SLCDC_CR__FRZKEY"/>
        </register>
        <register caption="Mode Register" name="SLCDC_MR" offset="0x4" rw="RW" size="4">
          <bitfield caption="Selection of the Number of Commons" mask="0x00000007" name="COMSEL" values="SLCDC_MR__COMSEL"/>
          <bitfield caption="Selection of the Number of Segments" mask="0x00003F00" name="SEGSEL"/>
          <bitfield caption="Buffer On-Time" mask="0x000F0000" name="BUFTIME" values="SLCDC_MR__BUFTIME"/>
          <bitfield caption="LCD Display Configuration" mask="0x00300000" name="BIAS" values="SLCDC_MR__BIAS"/>
          <bitfield caption="Low-Power Mode" mask="0x01000000" name="LPMODE"/>
        </register>
        <register caption="Frame Rate Register" name="SLCDC_FRR" offset="0x8" rw="RW" size="4">
          <bitfield caption="Clock Prescaler" mask="0x00000007" name="PRESC" values="SLCDC_FRR__PRESC"/>
          <bitfield caption="Clock Division" mask="0x00000700" name="DIV" values="SLCDC_FRR__DIV"/>
        </register>
        <register caption="Display Register" name="SLCDC_DR" offset="0xC" rw="RW" size="4">
          <bitfield caption="Display Mode Register" mask="0x00000007" name="DISPMODE" values="SLCDC_DR__DISPMODE"/>
          <bitfield caption="LCD Blinking Frequency Selection" mask="0x0000FF00" name="LCDBLKFREQ"/>
        </register>
