Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX5112MTSH128S1.atdf
        <register caption="Status Register" name="SLCDC_SR" offset="0x10" rw="R" size="4">
          <bitfield caption="Enable Status (Automatically Set/Reset)" mask="0x00000001" name="ENA"/>
          <bitfield caption="Display Panel Features Configuration Freeze Status" mask="0x00000040" name="DFFRZS"/>
          <bitfield caption="Remapping Configuration Freeze Status" mask="0x00000080" name="MAPFRZS"/>
        </register>
        <register caption="Interrupt Enable Register" name="SLCDC_IER" offset="0x20" rw="W" size="4">
          <bitfield caption="End of Frame Interrupt Enable" mask="0x00000001" name="ENDFRAME"/>
          <bitfield caption="Disable Completion Interrupt Enable" mask="0x00000004" name="DIS"/>
        </register>
        <register caption="Interrupt Disable Register" name="SLCDC_IDR" offset="0x24" rw="W" size="4">
          <bitfield caption="End of Frame Interrupt Disable" mask="0x00000001" name="ENDFRAME"/>
          <bitfield caption="Disable Completion Interrupt Disable" mask="0x00000004" name="DIS"/>
        </register>
        <register caption="Interrupt Mask Register" name="SLCDC_IMR" offset="0x28" rw="R" size="4">
          <bitfield caption="End of Frame Interrupt Mask" mask="0x00000001" name="ENDFRAME"/>
          <bitfield caption="Disable Completion Interrupt Mask" mask="0x00000004" name="DIS"/>
        </register>
        <register caption="Interrupt Status Register" name="SLCDC_ISR" offset="0x2C" rw="R" size="4">
          <bitfield caption="End of Frame Interrupt Status" mask="0x00000001" name="ENDFRAME"/>
          <bitfield caption="Disable Completion Interrupt Status" mask="0x00000004" name="DIS"/>
        </register>
        <register caption="Segment Map Register 0" name="SLCDC_SMR0" offset="0x30" rw="RW" size="4">
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000001" name="LCD0"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000002" name="LCD1"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000004" name="LCD2"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000008" name="LCD3"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000010" name="LCD4"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000020" name="LCD5"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000040" name="LCD6"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000080" name="LCD7"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000100" name="LCD8"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000200" name="LCD9"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000400" name="LCD10"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00000800" name="LCD11"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00001000" name="LCD12"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00002000" name="LCD13"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00004000" name="LCD14"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00008000" name="LCD15"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00010000" name="LCD16"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00020000" name="LCD17"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00040000" name="LCD18"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00080000" name="LCD19"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00100000" name="LCD20"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00200000" name="LCD21"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00400000" name="LCD22"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x00800000" name="LCD23"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x01000000" name="LCD24"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x02000000" name="LCD25"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x04000000" name="LCD26"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x08000000" name="LCD27"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x10000000" name="LCD28"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x20000000" name="LCD29"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x40000000" name="LCD30"/>
          <bitfield caption="LCD Segment Mapped on SEGx I/O Pin" mask="0x80000000" name="LCD31"/>
        </register>
        <register caption="Write Protection Mode Register" name="SLCDC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SLCDC_WPMR__WPKEY"/>
        </register>
        <register caption="LSB Memory Register (com = 0)" name="SLCDC_LMEMR0" offset="0x200" rw="RW" size="4">
          <bitfield caption="LSB Pixels Pattern Associated to COMx Terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="LSB Memory Register (com = 1)" name="SLCDC_LMEMR1" offset="0x208" rw="RW" size="4">
          <bitfield caption="LSB Pixels Pattern Associated to COMx Terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="LSB Memory Register (com = 2)" name="SLCDC_LMEMR2" offset="0x210" rw="RW" size="4">
          <bitfield caption="LSB Pixels Pattern Associated to COMx Terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
        <register caption="LSB Memory Register (com = 3)" name="SLCDC_LMEMR3" offset="0x218" rw="RW" size="4">
          <bitfield caption="LSB Pixels Pattern Associated to COMx Terminal" mask="0xFFFFFFFF" name="LPIXEL"/>
        </register>
