Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/atdf/PIC32CX5112MTSH128S1.atdf
      <value-group caption="Burst Signal Selection" name="TC_CMR__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="External Event Edge Selection" name="TC_CMR__EEVTEDG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="External Event Selection" name="TC_CMR__EEVT">
        <value caption="TIOB" name="TIOB" value="0x0"/>
        <value caption="XC0" name="XC0" value="0x1"/>
        <value caption="XC1" name="XC1" value="0x2"/>
        <value caption="XC2" name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="Waveform Selection" name="TC_CMR__WAVSEL">
        <value caption="UP mode without automatic trigger on RC Compare" name="UP" value="0x0"/>
        <value caption="UPDOWN mode without automatic trigger on RC Compare" name="UPDOWN" value="0x1"/>
        <value caption="UP mode with automatic trigger on RC Compare" name="UP_RC" value="0x2"/>
        <value caption="UPDOWN mode with automatic trigger on RC Compare" name="UPDOWN_RC" value="0x3"/>
      </value-group>
      <value-group caption="RA Compare Effect on TIOAx" name="TC_CMR__ACPA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="RC Compare Effect on TIOAx" name="TC_CMR__ACPC">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="External Event Effect on TIOAx" name="TC_CMR__AEEVT">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="Software Trigger Effect on TIOAx" name="TC_CMR__ASWTRG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="RB Compare Effect on TIOBx" name="TC_CMR__BCPB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="RC Compare Effect on TIOBx" name="TC_CMR__BCPC">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="External Event Effect on TIOBx" name="TC_CMR__BEEVT">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="Software Trigger Effect on TIOBx" name="TC_CMR__BSWTRG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Set" name="SET" value="0x1"/>
        <value caption="Clear" name="CLEAR" value="0x2"/>
        <value caption="Toggle" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="Trigger Source for Input A" name="TC_EMR0__TRIGSRCA">
        <value caption="The trigger/capture input A is driven by external pin TIOAx" name="EXTERNAL_TIOAx" value="0"/>
        <value caption="The trigger/capture input A is driven internally by PWMx" name="PWMx" value="1"/>
      </value-group>
      <value-group caption="Trigger Source for Input B" name="TC_EMR0__TRIGSRCB">
        <value caption="The trigger/capture input B is driven by external pin TIOBx" name="EXTERNAL_TIOBx" value="0"/>
        <value caption="The trigger/capture input B is driven internally by the comparator output (see Figure 7-16) of the PWMx." name="PWMx" value="1"/>
      </value-group>
      <value-group caption="Software Error Type (cleared on read)" name="TC_SSR0__SWETYP">
        <value caption="TC Channel x is enabled and a write-only register has been read (Warning)." name="READ_WO" value="0x0"/>
        <value caption="TC Channel x is enabled and a write access has been performed on a read-only register (Warning)." name="WRITE_RO" value="0x1"/>
        <value caption="Access to an undefined address of the TC (Warning)." name="UNDEF_RW" value="0x2"/>
        <value caption="TC_RAx or TC_RBx are written while channel is enabled and configured in capture mode (Error)." name="W_RARB_CAPT" value="0x3"/>
      </value-group>
      <value-group caption="Software Error Class" name="TC_SSR0__ECLASS">
        <value caption="An abnormal access that does not have any impact." name="WARNING" value="0"/>
        <value caption="An abnormal access that may have an impact." name="ERROR" value="1"/>
      </value-group>
      <value-group caption="External Clock Signal 0 Selection" name="TC_BMR__TC0XC0S">
        <value caption="Signal connected to XC0: TCLK0" name="TCLK0" value="0x0"/>
        <value caption="Signal connected to XC0: TIOA1" name="TIOA1" value="0x2"/>
        <value caption="Signal connected to XC0: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="External Clock Signal 1 Selection" name="TC_BMR__TC1XC1S">
        <value caption="Signal connected to XC1: TCLK1" name="TCLK1" value="0x0"/>
        <value caption="Signal connected to XC1: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC1: TIOA2" name="TIOA2" value="0x3"/>
      </value-group>
      <value-group caption="External Clock Signal 2 Selection" name="TC_BMR__TC2XC2S">
        <value caption="Signal connected to XC2: TCLK2" name="TCLK2" value="0x0"/>
        <value caption="Signal connected to XC2: TIOA0" name="TIOA0" value="0x2"/>
        <value caption="Signal connected to XC2: TIOA1" name="TIOA1" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key" name="TC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x54494D"/>
      </value-group>
      <value-group caption="Write Protection Key" name="TC_PWPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x504443"/>
      </value-group>
    </module>
    <module caption="Universal Asynchronous Receiver Transmitter" name="UART" id="6418" version="ZA">
      <register-group name="UART">
        <register caption="Control Register" name="UART_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status" mask="0x00000100" name="RSTSTA"/>
          <bitfield caption="Rearm Time-out" mask="0x00000400" name="RETTO"/>
          <bitfield caption="Start Time-out" mask="0x00000800" name="STTTO"/>
          <bitfield caption="Request Clear" mask="0x00001000" name="REQCLR"/>
          <bitfield caption="Optical Logic Sleep Mode Command" mask="0x00004000" name="OPT_SLEEP"/>
        </register>
        <register caption="Mode Register" name="UART_MR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="UART Optical Interface Enable" mask="0x00000001" name="OPT_EN" values="UART_MR__OPT_EN"/>
          <bitfield caption="UART Receive Data Inverted" mask="0x00000002" name="OPT_RXINV" values="UART_MR__OPT_RXINV"/>
          <bitfield caption="UART Modulated Data Inverted" mask="0x00000004" name="OPT_MDINV" values="UART_MR__OPT_MDINV"/>
          <bitfield caption="Optical Demodulation Enable" mask="0x00000008" name="OPT_DMOD" values="UART_MR__OPT_DMOD"/>
          <bitfield caption="Receiver Digital Filter" mask="0x00000010" name="FILTER" values="UART_MR__FILTER"/>
          <bitfield caption="Analog Comparator Enable" mask="0x00000020" name="ACON" values="UART_MR__ACON"/>
          <bitfield caption="Analog Comparator Output Edge Selection" mask="0x000000C0" name="EDGESEL" values="UART_MR__EDGESEL"/>
          <bitfield caption="Optical Link Activity Wake-up Enable" mask="0x00000100" name="OPT_WKUP" values="UART_MR__OPT_WKUP"/>
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="UART_MR__PAR"/>
          <bitfield caption="Baud Rate Source Clock" mask="0x00001000" name="BRSRCCK" values="UART_MR__BRSRCCK"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="UART_MR__CHMODE"/>
          <bitfield caption="Optical Link Clock Divider" mask="0x001F0000" name="OPT_CLKDIV"/>
          <bitfield caption="Optical Link Modulation Clock Duty Cycle" mask="0x07000000" name="OPT_DUTY" values="UART_MR__OPT_DUTY"/>
          <bitfield caption="Receive Path Comparator Threshold" mask="0x70000000" name="OPT_CMPTH" values="UART_MR__OPT_CMPTH"/>
        </register>
        <register caption="Interrupt Enable Register" name="UART_IER" offset="0x0008" rw="W" size="4">
          <bitfield caption="Enable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Enable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Enable End of Receive Transfer Interrupt" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Enable End of Transmit Interrupt" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Enable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Enable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Enable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Enable Time-out Interrupt" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Enable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Enable Buffer Empty Interrupt" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Enable Buffer Full Interrupt" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Enable Comparison Interrupt" mask="0x00008000" name="CMP"/>
          <bitfield caption="Enable Analog Comparator Event Interrupt" mask="0x00010000" name="ACE"/>
        </register>
        <register caption="Interrupt Disable Register" name="UART_IDR" offset="0x000C" rw="W" size="4">
          <bitfield caption="Disable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Disable End of Receive Transfer Interrupt" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Disable End of Transmit Interrupt" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Disable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Disable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Disable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Disable Time-out Interrupt" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Disable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Disable Buffer Empty Interrupt" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Disable Buffer Full Interrupt" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Disable Comparison Interrupt" mask="0x00008000" name="CMP"/>
          <bitfield caption="Disable Analog Comparator Event Interrupt" mask="0x00010000" name="ACE"/>
        </register>
